INSERT INTO 'Disciplines' VALUES
(0, 'Математический Анализ', 2020),
(1, 'Машинное Обучение', 2020),
(2, 'Теория Баз Данных', 2020),
(3, 'Дискретная математика', 2020);


INSERT INTO 'Classes' VALUES 
(1, 'Лекция', 'Математический анализ', 0, 'www.url.com', 'www.url.com'),
(2, 'Семинар', 'Математический анализ', 0,'www.url.com', 'www.url.com'),
(3, 'Семинар', 'Математический анализ', 0,'www.url.com', 'www.url.com'),
(4, 'Лекция', 'Машинное Обучение', 0,'www.url.com', 'www.url.com'),
(5, 'Лекция', 'Теория Баз Данных', 0,'www.url.com', 'www.url.com');

INSERT INTO 'Groups' VALUES 
(0, 0),
(1, 0),
(2, 1),
(3, 2),
(4, 1);

INSERT INTO 'Classes_Groups' VALUES 
(1, 0, 'Лекция', 'online', '2020-12-20 14:00:00.000'),
(1, 1, 'Лекция', 'online', '2020-12-20 14:00:00.000'),
(2, 0, 'Семинар', 'online', '2020-12-21 14:00:00.000'),
(3, 1, 'Семинар', 'online', '2020-12-21 14:00:00.000'),
(4, 2, 'Лекция', 'online', '2020-12-22 14:00:00.000'),
(4, 4, 'Лекция', 'online', '2020-12-22 14:00:00.000'),
(5, 3, 'Лекция', 'online', '2020-12-22 14:00:00.000');


INSERT INTO 'Students' VALUES 
(0, 185, 'Василий Пупкин', 2020, '-'),
(1, 185, 'Игорь Кек', 2020, '-'),
(2, 185, 'Ирина Кринж', 2020, '-'),
(3, 184, 'Максим Волк', 2020, '-'),
(4, 184, 'Олег Лес', 2020, '-'),
(5, 184, 'Дмитрий Стол', 2020, '-'),
(6, 184, 'Екатерина Ковер', 2020, '-');


INSERT INTO 'Operators' VALUES 
(0, 'Федор Джон', 'fedor_jhon@mail.com', '8999999999', '-'),
(1, 'Квентин Тарантино', 'tarantino@mail.com', '8999999999', '-'),
(2, 'Чак Паланик', 'palanik@mail.com', '8999999999', '-');

INSERT INTO 'Classes_Operators' VALUES 
(1, 0, 0),
(2, 1, 0),
(3, 0, 0),
(4, 2, 0),
(5, 2, 0);

INSERT INTO 'Groups_Students' VALUES 
(0, 0),
(0, 1),
(0, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(2, 0),
(2, 1),
(2, 2),
(4, 3),
(4, 4),
(4, 5),
(4, 6),
(3, 0),
(3, 2),
(3, 5);